stress-test.yaml
config:
  target: 'http://dev.somniumlabs.net:10000'
  phases:
    - duration: 60
      arrivalRate: 100

scenarios:
  - flow:
      - loop:
          - post:
              url: '/api/auth/kakao-authentication'
              json:
                idToken: 'eyJraWQiOiI5ZjI1MmRhZGQ1ZjIzM2Y5M2QyZmE1MjhkMTJmZWEiLCJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiJ9.eyJhdWQiOiJhOWMzYTIzNTg5ODA0YjM4NzEyYTMwMGYyNmFkY2YwMiIsInN1YiI6IjI5NDQzODM3MDgiLCJhdXRoX3RpbWUiOjE2OTIxMDM3MTEsImlzcyI6Imh0dHBzOi8va2F1dGgua2FrYW8uY29tIiwiZXhwIjoxNjkyMTQ2OTExLCJpYXQiOjE2OTIxMDM3MTEsIm5vbmNlIjoiYjUzYTZhMmEtOTJlYy00ODU3LThmYWYtMTkyNzEzZDJmMTdkIn0.PmoktYGpdfVnxKBHBHdw9Vs1hSHKSkiI86rJrgGAqY0vODR0Sg7xWxa7bP7ylzxWKuyzdM5jMoJVDZtlurKv3ty4Vp2zjvvYkyqOx1N-vLhAH0GELOlzPSpx-bcx5zFK7STS5Jt__aifHdSEyoV0l99Zzt2NyRYM1X3stH4nm-Fa8hTMg63rSC6oc87EyKOAKUdKCGPFb53cVRNgUGm3f6i3E0CiRq-LmDbFF2x7x9glHQ43gU8HBoZXq3rQz0UuLYR_COXqwhok6yC1Y-0CyXYx1LonPOKap4uIXAhybLkVE9edxIdA576aoqrADsHIKxx4qImJehymg1exYGr8BA'
                nonce: 'b53a6a2a-92ec-4857-8faf-192713d2f17d'
        count: 25